/*---------------------------------------------------
	1546 평균
	수학, 구현(배열)
	문제정보 :	세준이는 기말고사를 망쳤다. 세준이는 점수를 조작해서 집에 가져가기로 했다. 일단 세준이는 자기 점수 중에 최댓값을 골랐다. 
				이 값을 M이라고 한다. 그리고 나서 모든 점수를 점수/M*100으로 고쳤다.
				예를 들어, 세준이의 최고점이 70이고, 수학점수가 50이었으면 수학점수는 50/70*100이 되어 71.43점이 된다.
				세준이의 성적을 위의 방법대로 새로 계산했을 때, 새로운 평균을 구하는 프로그램을 작성하시오.
	조건 :
		Input)	시험 본 과목의 개수 N (N ≤ 1000), 
				현재 성적 K. (K ≤ 100) 음이 아닌 정수이고, 적어도 하나의 값은 0보다 크다.
		Output) 새로운 평균을 출력한다. 정답과의 절대/상대 오차는 10^-2까지 허용
----------------------------------------------------*/
#include <iostream>

using namespace std;

int main()
{
	int N, grade[1000], maxGrade = 0;
	double total = 0;
	scanf_s("%d", &N);
	for (int i = 0; i < N; ++i)
	{
		scanf_s("%d", &grade[i]);
		if (maxGrade < grade[i])
			maxGrade = grade[i];
		total += grade[i] * 100;
	}
	total = total / (double)maxGrade / N;

	printf("%.6f", total);

	return 0;
}