/*---------------------------------------------------
	5339 콜센터
	입출력
	문제정보 : 스타워즈에 등장하는 로봇인 C3PO는 요즘 콜센터에 근무하고 있다. 
		 콜센터에 앉아있는 C3PO를 그리는 프로그램을 작성하시오.
	조건 :
		Input)	예제 출력처럼 콜센터에 앉아있는 C3PO를 출력한다. 마지막 세 줄의 두 '|' 사이에는 공백이 10개 있다.
----------------------------------------------------*/
#include <iostream>

using namespace std;

int main()
{
    printf("     /~\\\n");
    printf("    ( oo|\n");
    printf("    _\\=/_\n");
    printf("   /  _  \\\n");
    printf("  //|/.\\|\\\\ \n");
    printf(" ||  \\ /  ||\n");
    printf("============\n");
    printf("|          |\n");
    printf("|          |\n");
    printf("|          |\n");
    
    return 0;
}